Infineon/mtb-example-psoc6-emwin-eink-freertos/AppWizProj/Demo/Source/CustomCode/ID_SCREEN_03_Slots.c
/*********************************************************************
*                     SEGGER Microcontroller GmbH                    *
*        Solutions for real time microcontroller applications        *
**********************************************************************
*                                                                    *
*        (c) 1996 - 2023  SEGGER Microcontroller GmbH                *
*                                                                    *
*        Internet: www.segger.com    Support:  support@segger.com    *
*                                                                    *
**********************************************************************
----------------------------------------------------------------------
File        : ID_SCREEN_03_Slots.c
Purpose     : AppWizard managed file, function content could be changed
---------------------------END-OF-HEADER------------------------------
*/

#include "Application.h"
#include "../Generated/Resource.h"
#include "../Generated/ID_SCREEN_03.h"

/*** Begin of user code area ***/
#include "cy_pdl.h"
#include "cyhal.h"
#include "cybsp.h"
#include "../../../../source/eink_task.h"
/*** End of user code area ***/

/*********************************************************************
*
*       Public code
*
**********************************************************************
*/
/*********************************************************************
*
*       cbID_SCREEN_03
*/
void cbID_SCREEN_03(WM_MESSAGE * pMsg) {
    GUI_USE_PARA(pMsg);
}

/*********************************************************************
*
*       ID_SCREEN_03__APPW_NOTIFICATION_INITDIALOG__ID_TIMER_00__APPW_JOB_START
*/
void ID_SCREEN_03__APPW_NOTIFICATION_INITDIALOG__ID_TIMER_00__APPW_JOB_START(APPW_ACTION_ITEM * pAction, WM_HWIN hScreen, WM_MESSAGE * pMsg, int * pResult) {
  TEXT_Handle hText;
  GUI_USE_PARA(pAction);
  GUI_USE_PARA(hScreen);
  GUI_USE_PARA(pMsg);
  GUI_USE_PARA(pResult);
  hText = WM_GetDialogItem(hScreen, ID_TEXT_01);
  TEXT_SetFont(hText, GUI_FONT_13B_1);
  hText = WM_GetDialogItem(hScreen, ID_TEXT_02);
  TEXT_SetFont(hText, GUI_FONT_13HB_1);
  hText = WM_GetDialogItem(hScreen, ID_TEXT_03);
  TEXT_SetFont(hText, GUI_FONT_16B_1);
  hText = WM_GetDialogItem(hScreen, ID_TEXT_04);
  TEXT_SetFont(hText, GUI_FONT_COMIC18B_1);
  hText = WM_GetDialogItem(hScreen, ID_TEXT_05);
  TEXT_SetFont(hText, GUI_FONT_20B_1);
  hText = WM_GetDialogItem(hScreen, ID_TEXT_06);
  TEXT_SetFont(hText, GUI_FONT_24B_1);
  hText = WM_GetDialogItem(hScreen, ID_TEXT_07);
  TEXT_SetFont(hText, GUI_FONT_32B_1);
}

/*********************************************************************
*
*       ID_SCREEN_03__ID_TIMER_00__APPW_NOTIFICATION_TIMER
*/
void ID_SCREEN_03__ID_TIMER_00__APPW_NOTIFICATION_TIMER(APPW_ACTION_ITEM * pAction, WM_HWIN hScreen, WM_MESSAGE * pMsg, int * pResult) {
  GUI_USE_PARA(pAction);
  GUI_USE_PARA(hScreen);
  GUI_USE_PARA(pMsg);
  GUI_USE_PARA(pResult);
  cyhal_gpio_write( CYBSP_USER_LED, CYBSP_LED_STATE_OFF);
  wait_for_switch_press_and_release();
  cyhal_gpio_write( CYBSP_USER_LED, CYBSP_LED_STATE_ON);
}

/*************************** End of file ****************************/
